SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_mpahbram.h
/* Bit fields for MPAHBRAM CFGSRTOP */
#define _MPAHBRAM_CFGSRTOP_RESETVALUE           0x00000000UL                            /**< Default value for MPAHBRAM_CFGSRTOP         */
#define _MPAHBRAM_CFGSRTOP_MASK                 0x00000001UL                            /**< Mask for MPAHBRAM_CFGSRTOP                  */
#define MPAHBRAM_CFGSRTOP_SRTOP                 (0x1UL << 0)                            /**< Sequential region on top                    */
#define _MPAHBRAM_CFGSRTOP_SRTOP_SHIFT          0                                       /**< Shift value for MPAHBRAM_SRTOP              */
#define _MPAHBRAM_CFGSRTOP_SRTOP_MASK           0x1UL                                   /**< Bit mask for MPAHBRAM_SRTOP                 */
#define _MPAHBRAM_CFGSRTOP_SRTOP_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CFGSRTOP          */
#define MPAHBRAM_CFGSRTOP_SRTOP_DEFAULT         (_MPAHBRAM_CFGSRTOP_SRTOP_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_CFGSRTOP  */

/* Bit fields for MPAHBRAM CFGSRMAP */
#define _MPAHBRAM_CFGSRMAP_RESETVALUE           0xFFFFFFFFUL                            /**< Default value for MPAHBRAM_CFGSRMAP         */
#define _MPAHBRAM_CFGSRMAP_MASK                 0x0000FFFFUL                            /**< Mask for MPAHBRAM_CFGSRMAP                  */
#define _MPAHBRAM_CFGSRMAP_MAP_SHIFT            0                                       /**< Shift value for MPAHBRAM_MAP                */
#define _MPAHBRAM_CFGSRMAP_MAP_MASK             0xFFFFUL                                /**< Bit mask for MPAHBRAM_MAP                   */
#define _MPAHBRAM_CFGSRMAP_MAP_DEFAULT          0xFFFFFFFFUL                            /**< Mode DEFAULT for MPAHBRAM_CFGSRMAP          */
#define MPAHBRAM_CFGSRMAP_MAP_DEFAULT           (_MPAHBRAM_CFGSRMAP_MAP_DEFAULT << 0)   /**< Shifted mode DEFAULT for MPAHBRAM_CFGSRMAP  */

/* Bit fields for MPAHBRAM CFGIU0MAP */
#define _MPAHBRAM_CFGIU0MAP_RESETVALUE          0x00000000UL                            /**< Default value for MPAHBRAM_CFGIU0MAP        */
#define _MPAHBRAM_CFGIU0MAP_MASK                0x0000FFFFUL                            /**< Mask for MPAHBRAM_CFGIU0MAP                 */
#define _MPAHBRAM_CFGIU0MAP_MAP_SHIFT           0                                       /**< Shift value for MPAHBRAM_MAP                */
#define _MPAHBRAM_CFGIU0MAP_MAP_MASK            0xFFFFUL                                /**< Bit mask for MPAHBRAM_MAP                   */
#define _MPAHBRAM_CFGIU0MAP_MAP_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CFGIU0MAP         */
#define MPAHBRAM_CFGIU0MAP_MAP_DEFAULT          (_MPAHBRAM_CFGIU0MAP_MAP_DEFAULT << 0)  /**< Shifted mode DEFAULT for MPAHBRAM_CFGIU0MAP */

/* Bit fields for MPAHBRAM CFGIU1MAP */
#define _MPAHBRAM_CFGIU1MAP_RESETVALUE          0x00000000UL                            /**< Default value for MPAHBRAM_CFGIU1MAP        */
#define _MPAHBRAM_CFGIU1MAP_MASK                0x0000FFFFUL                            /**< Mask for MPAHBRAM_CFGIU1MAP                 */
#define _MPAHBRAM_CFGIU1MAP_MAP_SHIFT           0                                       /**< Shift value for MPAHBRAM_MAP                */
#define _MPAHBRAM_CFGIU1MAP_MAP_MASK            0xFFFFUL                                /**< Bit mask for MPAHBRAM_MAP                   */
#define _MPAHBRAM_CFGIU1MAP_MAP_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CFGIU1MAP         */
#define MPAHBRAM_CFGIU1MAP_MAP_DEFAULT          (_MPAHBRAM_CFGIU1MAP_MAP_DEFAULT << 0)  /**< Shifted mode DEFAULT for MPAHBRAM_CFGIU1MAP */

/* Bit fields for MPAHBRAM CFGIU2MAP */
#define _MPAHBRAM_CFGIU2MAP_RESETVALUE          0x00000000UL                            /**< Default value for MPAHBRAM_CFGIU2MAP        */
#define _MPAHBRAM_CFGIU2MAP_MASK                0x0000FFFFUL                            /**< Mask for MPAHBRAM_CFGIU2MAP                 */
#define _MPAHBRAM_CFGIU2MAP_MAP_SHIFT           0                                       /**< Shift value for MPAHBRAM_MAP                */
#define _MPAHBRAM_CFGIU2MAP_MAP_MASK            0xFFFFUL                                /**< Bit mask for MPAHBRAM_MAP                   */
#define _MPAHBRAM_CFGIU2MAP_MAP_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CFGIU2MAP         */
#define MPAHBRAM_CFGIU2MAP_MAP_DEFAULT          (_MPAHBRAM_CFGIU2MAP_MAP_DEFAULT << 0)  /**< Shifted mode DEFAULT for MPAHBRAM_CFGIU2MAP */

/* Bit fields for MPAHBRAM CFGIU3MAP */
#define _MPAHBRAM_CFGIU3MAP_RESETVALUE          0x00000000UL                            /**< Default value for MPAHBRAM_CFGIU3MAP        */
#define _MPAHBRAM_CFGIU3MAP_MASK                0x0000FFFFUL                            /**< Mask for MPAHBRAM_CFGIU3MAP                 */
#define _MPAHBRAM_CFGIU3MAP_MAP_SHIFT           0                                       /**< Shift value for MPAHBRAM_MAP                */
#define _MPAHBRAM_CFGIU3MAP_MAP_MASK            0xFFFFUL                                /**< Bit mask for MPAHBRAM_MAP                   */
#define _MPAHBRAM_CFGIU3MAP_MAP_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for MPAHBRAM_CFGIU3MAP         */
#define MPAHBRAM_CFGIU3MAP_MAP_DEFAULT          (_MPAHBRAM_CFGIU3MAP_MAP_DEFAULT << 0)  /**< Shifted mode DEFAULT for MPAHBRAM_CFGIU3MAP */

/** @} End of group EFR32SG28_MPAHBRAM_BitFields */
/** @} End of group EFR32SG28_MPAHBRAM */
/** @} End of group Parts */

#endif // EFR32SG28_MPAHBRAM_H
